# Day 25 of 100 Days of Machine Learning

# Pandas - Part 2

In [1]:
import pandas as pd
import numpy as np

#### reindexing in pandas

In [2]:
object1 = pd.DataFrame(np.arange(9).reshape((3,3)), index = [ 1, 0, 2], columns=['col1', 'col2', 'col3'])
object1

   col1  col2  col3
1     0     1     2
0     3     4     5
2     6     7     8

In [3]:
object1.reindex([0,1,2])

   col1  col2  col3
0     3     4     5
1     0     1     2
2     6     7     8

In [4]:
object1.reindex([0,1,2,3])

   col1  col2  col3
0   3.0   4.0   5.0
1   0.0   1.0   2.0
2   6.0   7.0   8.0
3   NaN   NaN   NaN

In [5]:
object1.reindex(columns=['col2','col3','col1'])

   col2  col3  col1
1     1     2     0
0     4     5     3
2     7     8     6

#### Droping rows from the data frame.

In [6]:
object1.drop([1])

   col1  col2  col3
0     3     4     5
2     6     7     8

In [7]:
object1.drop(['col2'], axis=1)

   col1  col3
1     0     2
0     3     5
2     6     8

In [8]:
object1 = pd.DataFrame(np.arange(9).reshape((3,3)), index = [ 0, 1, 2], columns=['col1', 'col2', 'col3'])
object1

   col1  col2  col3
0     0     1     2
1     3     4     5
2     6     7     8

In [9]:
f = lambda x: x.max() - x.mean()
object1.apply(f)

col1    3.0
col2    3.0
col3    3.0
dtype: float64

In [10]:
object1.apply(f, axis='columns')

0    1.0
1    1.0
2    1.0
dtype: float64

### Descriptive Statistics

In [11]:
df = pd.DataFrame(np.random.randn(4,3), index=['a', 'b', 'c', 'd'])
df

          0         1         2
a  1.015842  0.730434  0.366699
b -1.033913  0.190256  0.961001
c -0.736941 -0.706110 -0.377278
d -1.244126 -1.221054 -0.116585

In [12]:
df.describe()

              0         1         2
count  4.000000  4.000000  4.000000
mean  -0.499785 -0.251619  0.208459
std    1.031617  0.876745  0.588813
min   -1.244126 -1.221054 -0.377278
25%   -1.086466 -0.834846 -0.181758
50%   -0.885427 -0.257927  0.125057
75%   -0.298746  0.325300  0.515274
max    1.015842  0.730434  0.961001

In [13]:
df.sum()

0   -1.999139
1   -1.006475
2    0.833837
dtype: float64

In [14]:
df.sum(axis='columns')

a    2.112974
b    0.117344
c   -1.820330
d   -2.581765
dtype: float64

In [15]:
df.mean()

0   -0.499785
1   -0.251619
2    0.208459
dtype: float64

In [16]:
df.mean(axis='columns')

a    0.704325
b    0.039115
c   -0.606777
d   -0.860588
dtype: float64

In [17]:
df.min()

0   -1.244126
1   -1.221054
2   -0.377278
dtype: float64

In [18]:
df.max()

0    1.015842
1    0.730434
2    0.961001
dtype: float64

In [19]:
df.median()

0   -0.885427
1   -0.257927
2    0.125057
dtype: float64

In [20]:
df.idxmin()

0    d
1    d
2    c
dtype: object

In [21]:
df.idxmax()

0    a
1    a
2    b
dtype: object

In [22]:
df.var()

0    1.064235
1    0.768682
2    0.346700
dtype: float64

In [23]:
df.std()

0    1.031617
1    0.876745
2    0.588813
dtype: float64

In [24]:
df.skew()

0    1.763067
1    0.028128
2    0.636290
dtype: float64

In [25]:
df.kurt()

0    3.182322
1   -2.814428
2   -1.014900
dtype: float64

In [26]:
import pandas_datareader.data as web
import datetime

In [27]:
df = web.DataReader('TUD', 'oecd')
df

Country                Hungary                                                 \
Source     Administrative data                                    Survey data
Series               Employees Union members Trade union  density   Employees
Year
2016-01-01                 NaN           NaN                  NaN         NaN
2017-01-01                 NaN           NaN                  NaN         NaN
2018-01-01                 NaN           NaN                  NaN         NaN

Country                                                    Mexico  \
Source                                        Administrative data
Series     Union members Trade union  density           Employees
Year
2016-01-01           NaN                  NaN                 NaN
2017-01-01           NaN                  NaN                 NaN
2018-01-01           NaN                  NaN                 NaN

Country                                                    ...  \
Source                                        Survey data  ...
Series     Union members Trade union  density   Employees  ...
Year                                                       ...
2016-01-01           NaN                  NaN         NaN  ...
2017-01-01           NaN                  NaN         NaN  ...
2018-01-01           NaN                  NaN         NaN  ...

Country                Portugal                            \
Source      Administrative data Survey data
Series     Trade union  density   Employees Union members
Year
2016-01-01                  NaN         NaN           NaN
2017-01-01                 41.2         NaN           NaN
2018-01-01                  NaN         NaN           NaN

Country                                     Germany                \
Source                          Administrative data
Series     Trade union  density           Employees Union members
Year
2016-01-01                  NaN             22768.0        7893.0
2017-01-01                  NaN             23269.0        7892.0
2018-01-01                  NaN             23822.0        7888.0

Country
Source                          Survey data
Series     Trade union  density   Employees Union members Trade union  density
Year
2016-01-01                 34.7         NaN           NaN                  NaN
2017-01-01                 33.9         NaN           NaN                  NaN
2018-01-01                 33.1         NaN           NaN                  NaN

[3 rows x 216 columns]

In [28]:
df.columns

MultiIndex(levels=[['Australia', 'Austria', 'Belgium', 'Canada', 'Chile', 'Czech Republic', 'Denmark', 'Estonia', 'Finland', 'France', 'Germany', 'Greece', 'Hungary', 'Iceland', 'Ireland', 'Israel', 'Italy', 'Japan', 'Korea', 'Latvia', 'Lithuania', 'Luxembourg', 'Mexico', 'Netherlands', 'New Zealand', 'Norway', 'Poland', 'Portugal', 'Slovak Republic', 'Slovenia', 'Spain', 'Sweden', 'Switzerland', 'Turkey', 'United Kingdom', 'United States'], ['Administrative data', 'Survey data'], ['Employees', 'Trade union  density', 'Union members']],
           codes=[[12, 12, 12, 12, 12, 12, 22, 22, 22, 22, 22, 22, 14, 14, 14, 14, 14, 14, 34, 34, 34, 34, 34, 34, 20, 20, 20, 20, 20, 20, 26, 26, 26, 26, 26, 26, 31, 31, 31, 31, 31, 31, 1, 1, 1, 1, 1, 1, 3, 3, 3, 3, 3, 3, 8, 8, 8, 8, 8, 8, 13, 13, 13, 13, 13, 13, 9, 9, 9, 9, 9, 9, 17, 17, 17, 17, 17, 17, 0, 0, 0, 0, 0, 0, 23, 23, 23, 23, 23, 23, 5, 5, 5, 5, 5, 5, 35, 35, 35, 35, 35, 35, 18, 18, 18, 18, 18, 18, 32, 32, 32, 32, 32, 32, 33, 33, 33, 33, 33, 33, 25, 25, 25, 25, 25, 25, 11, 11, 11, 11, 11, 11, 19, 19, 19, 19, 19, 19, 7, 7, 7, 7, 7, 7, 24, 24, 24, 24, 24, 24, 15, 15, 15, 15, 15, 15, 6, 6, 6, 6, 6, 6, 29, 29, 29, 29, 29, 29, 28, 28, 28, 28, 28, 28, 21, 21, 21, 21, 21, 21, 2, 2, 2, 2, 2, 2, 30, 30, 30, 30, 30, 30, 4, 4, 4, 4, 4, 4, 16, 16, 16, 16, 16, 16, 27, 27, 27, 27, 27, 27, 10, 10, 10, 10, 10, 10], [0, 0, 0, 1, 1, 1, 0, 0, 0, 1, 1, 1, 0, 0, 0, 1, 1, 1, 0, 0, 0, 1, 1, 1, 0, 0, 0, 1, 1, 1, 0, 0, 0, 1, 1, 1, 0, 0, 0, 1, 1, 1, 0, 0, 0, 1, 1, 1, 0, 0, 0, 1, 1, 1, 0, 0, 0, 1, 1, 1, 0, 0, 0, 1, 1, 1, 0, 0, 0, 1, 1, 1, 0, 0, 0, 1, 1, 1, 0, 0, 0, 1, 1, 1, 0, 0, 0, 1, 1, 1, 0, 0, 0, 1, 1, 1, 0, 0, 0, 1, 1, 1, 0, 0, 0, 1, 1, 1, 0, 0, 0, 1, 1, 1, 0, 0, 0, 1, 1, 1, 0, 0, 0, 1, 1, 1, 0, 0, 0, 1, 1, 1, 0, 0, 0, 1, 1, 1, 0, 0, 0, 1, 1, 1, 0, 0, 0, 1, 1, 1, 0, 0, 0, 1, 1, 1, 0, 0, 0, 1, 1, 1, 0, 0, 0, 1, 1, 1, 0, 0, 0, 1, 1, 1, 0, 0, 0, 1, 1, 1, 0, 0, 0, 1, 1, 1, 0, 0, 0, 1, 1, 1, 0, 0, 0, 1, 1, 1, 0, 0, 0, 1, 1, 1, 0, 0, 0, 1, 1, 1, 0, 0, 0, 1, 1, 1], [0, 2, 1, 0, 2, 1, 0, 2, 1, 0, 2, 1, 0, 2, 1, 0, 2, 1, 0, 2, 1, 0, 2, 1, 0, 2, 1, 0, 2, 1, 0, 2, 1, 0, 2, 1, 0, 2, 1, 0, 2, 1, 0, 2, 1, 0, 2, 1, 0, 2, 1, 0, 2, 1, 0, 2, 1, 0, 2, 1, 0, 2, 1, 0, 2, 1, 0, 2, 1, 0, 2, 1, 0, 2, 1, 0, 2, 1, 0, 2, 1, 0, 2, 1, 0, 2, 1, 0, 2, 1, 0, 2, 1, 0, 2, 1, 0, 2, 1, 0, 2, 1, 0, 2, 1, 0, 2, 1, 0, 2, 1, 0, 2, 1, 0, 2, 1, 0, 2, 1, 0, 2, 1, 0, 2, 1, 0, 2, 1, 0, 2, 1, 0, 2, 1, 0, 2, 1, 0, 2, 1, 0, 2, 1, 0, 2, 1, 0, 2, 1, 0, 2, 1, 0, 2, 1, 0, 2, 1, 0, 2, 1, 0, 2, 1, 0, 2, 1, 0, 2, 1, 0, 2, 1, 0, 2, 1, 0, 2, 1, 0, 2, 1, 0, 2, 1, 0, 2, 1, 0, 2, 1, 0, 2, 1, 0, 2, 1, 0, 2, 1, 0, 2, 1, 0, 2, 1, 0, 2, 1, 0, 2, 1, 0, 2, 1]],
           names=['Country', 'Source', 'Series'])

In [29]:
df[['New Zealand', 'Australia']]

Country            New Zealand                                                 \
Source     Administrative data                                    Survey data
Series               Employees Union members Trade union  density   Employees
Year
2016-01-01              1275.0         683.0                 53.6         NaN
2017-01-01                 NaN           NaN                  NaN         NaN
2018-01-01                 NaN           NaN                  NaN         NaN

Country                                                 Australia  \
Source                                        Administrative data
Series     Union members Trade union  density           Employees
Year
2016-01-01           NaN                  NaN              5691.0
2017-01-01           NaN                  NaN              5906.0
2018-01-01           NaN                  NaN              6283.0

Country                                                                  \
Source                                        Survey data
Series     Union members Trade union  density   Employees Union members
Year
2016-01-01        2625.0                 46.1         NaN           NaN
2017-01-01        2684.0                 45.4      5683.0        2594.0
2018-01-01        2689.0                 42.8      6102.0        2536.0

Country
Source
Series     Trade union  density
Year
2016-01-01                  NaN
2017-01-01                 45.6
2018-01-01                 41.6